RT-Thread/rt-thread/bsp/nxp/mcx/mcxc/Libraries/MCXC444/MCXC444/drivers/fsl_uart.c
        /* Enable parity error interrupt when parity mode is enable*/
        if (((uint8_t)UART_C1_PE_MASK & base->C1) != 0U)
        {
            base->C3 |= (uint8_t)UART_C3_PEIE_MASK;
        }
        EnableGlobalIRQ(irqMask);
    }

    /* Send data register empty and the interrupt is enabled. */
    if ((((uint32_t)kUART_TxDataRegEmptyFlag & status) != 0U) && ((base->C2 & UART_C2_TIE_MASK) != 0U))
    {
/* Get the bytes that available at this moment. */
#if defined(FSL_FEATURE_UART_HAS_FIFO) && FSL_FEATURE_UART_HAS_FIFO
        count = (uint8_t)FSL_FEATURE_UART_FIFO_SIZEn(base) - base->TCFIFO;
#else
        count = 1;
#endif

        while ((count != 0U) && (handle->txDataSize != 0U))
        {
#if defined(FSL_FEATURE_UART_HAS_FIFO) && FSL_FEATURE_UART_HAS_FIFO
            tempCount = (uint8_t)MIN(handle->txDataSize, (uint32_t)count);
#else
            tempCount = 1;
#endif

            /* Using non block API to write the data to the registers. */
            UART_WriteNonBlocking(base, handle->txData, tempCount);
            handle->txData += tempCount;
            handle->txDataSize -= tempCount;
            count -= tempCount;

            /* If all the data are written to data register, TX finished. */
            if (0U == handle->txDataSize)
            {
                /* Disable and re-enable the global interrupt to protect the interrupt enable register during
                 * read-modify-wrte. */
                irqMask = DisableGlobalIRQ();
                /* Disable TX register empty interrupt and enable transmission complete interrupt. */
                base->C2 = (base->C2 & ~(uint8_t)UART_C2_TIE_MASK) | (uint8_t)UART_C2_TCIE_MASK;
                EnableGlobalIRQ(irqMask);
            }
        }
    }

    /* Transmission complete and the interrupt is enabled. */
    if ((0U != ((uint32_t)kUART_TransmissionCompleteFlag & status)) && (0U != (base->C2 & UART_C2_TCIE_MASK)))
    {
        /* Set txState to idle only when all data has been sent out to bus. */
        handle->txState = (uint8_t)kUART_TxIdle;

        /* Disable and re-enable the global interrupt to protect the interrupt enable register during read-modify-wrte.
         */
        irqMask = DisableGlobalIRQ();
        /* Disable transmission complete interrupt. */
        base->C2 &= ~(uint8_t)UART_C2_TCIE_MASK;
        EnableGlobalIRQ(irqMask);

        /* Trigger callback. */
        if (handle->callback != NULL)
        {
            handle->callback(base, handle, kStatus_UART_TxIdle, handle->userData);
        }
    }
}

/*!
 * brief UART Error IRQ handle function.
 *
 * This function handles the UART error IRQ request.
 *
 * param base UART peripheral base address.
 * param irqHandle UART handle pointer.
 */
void UART_TransferHandleErrorIRQ(UART_Type *base, void *irqHandle)
{
    /* To be implemented by User. */
}

#if defined(FSL_FEATURE_UART_HAS_SHARED_IRQ0_IRQ1_IRQ2_IRQ3) && FSL_FEATURE_UART_HAS_SHARED_IRQ0_IRQ1_IRQ2_IRQ3
void UART0_UART1_UART2_UART3_DriverIRQHandler(void);
void UART0_UART1_UART2_UART3_DriverIRQHandler(void)
{
    for (uint32_t instance = 0U; instance < 4U; instance++)
    {
        if (s_uartHandle[instance] != NULL)
        {
            s_uartIsr(s_uartBases[instance], s_uartHandle[instance]);
        }
    }
}
#else
#if defined(FSL_FEATURE_UART_HAS_SHARED_IRQ0_IRQ1) && FSL_FEATURE_UART_HAS_SHARED_IRQ0_IRQ1
void UART0_UART1_DriverIRQHandler(void);
void UART0_UART1_DriverIRQHandler(void)
{
    for (uint32_t instance = 0U; instance < 2U; instance++)
    {
        if (s_uartHandle[instance] != NULL)
        {
            s_uartIsr(s_uartBases[instance], s_uartHandle[instance]);
        }
    }
}
#else /* FSL_FEATURE_UART_HAS_SHARED_IRQ0_IRQ1 */
#if defined(UART0)
#if ((!(defined(FSL_FEATURE_SOC_LPSCI_COUNT))) || \
     ((defined(FSL_FEATURE_SOC_LPSCI_COUNT)) && (FSL_FEATURE_SOC_LPSCI_COUNT == 0)))
void UART0_DriverIRQHandler(void);
void UART0_DriverIRQHandler(void)
{
    s_uartIsr(UART0, s_uartHandle[0]);
    SDK_ISR_EXIT_BARRIER;
}

void UART0_RX_TX_DriverIRQHandler(void);
void UART0_RX_TX_DriverIRQHandler(void)
{
    UART0_DriverIRQHandler();
    SDK_ISR_EXIT_BARRIER;
}
#endif /* FSL_FEATURE_SOC_LPSCI_COUNT */
#endif /* UART0 */

#if defined(UART1)
void UART1_DriverIRQHandler(void);
void UART1_DriverIRQHandler(void)
{
    s_uartIsr(UART1, s_uartHandle[1]);
    SDK_ISR_EXIT_BARRIER;
}

void UART1_RX_TX_DriverIRQHandler(void);
void UART1_RX_TX_DriverIRQHandler(void)
{
    UART1_DriverIRQHandler();
    SDK_ISR_EXIT_BARRIER;
}
#endif /* UART1 */
#endif /* FSL_FEATURE_UART_HAS_SHARED_IRQ0_IRQ1 */

#if defined(FSL_FEATURE_UART_HAS_SHARED_IRQ2_IRQ3) && FSL_FEATURE_UART_HAS_SHARED_IRQ2_IRQ3
void UART2_UART3_DriverIRQHandler(void);
void UART2_UART3_DriverIRQHandler(void)
{
    for (uint32_t instance = 2U; instance < 4U; instance++)
    {
        if (s_uartHandle[instance] != NULL)
        {
            s_uartIsr(s_uartBases[instance], s_uartHandle[instance]);
        }
    }
}
#else /* FSL_FEATURE_UART_HAS_SHARED_IRQ2_IRQ3 */
#if defined(UART2)
void UART2_DriverIRQHandler(void);
void UART2_DriverIRQHandler(void)
{
    s_uartIsr(UART2, s_uartHandle[2]);
    SDK_ISR_EXIT_BARRIER;
}

void UART2_RX_TX_DriverIRQHandler(void);
void UART2_RX_TX_DriverIRQHandler(void)
{
    UART2_DriverIRQHandler();
    SDK_ISR_EXIT_BARRIER;
}
#endif /* UART2 */

#if defined(UART3)
void UART3_DriverIRQHandler(void);
void UART3_DriverIRQHandler(void)
{
    s_uartIsr(UART3, s_uartHandle[3]);
    SDK_ISR_EXIT_BARRIER;
}

void UART3_RX_TX_DriverIRQHandler(void);
void UART3_RX_TX_DriverIRQHandler(void)
{
    UART3_DriverIRQHandler();
    SDK_ISR_EXIT_BARRIER;
}
#endif /* UART3 */
#endif /* FSL_FEATURE_UART_HAS_SHARED_IRQ2_IRQ3 */
#endif /* FSL_FEATURE_UART_HAS_SHARED_IRQ0_IRQ1_IRQ2_IRQ3 */

#if defined(UART4)
void UART4_DriverIRQHandler(void);
void UART4_DriverIRQHandler(void)
{
    s_uartIsr(UART4, s_uartHandle[4]);
    SDK_ISR_EXIT_BARRIER;
}

void UART4_RX_TX_DriverIRQHandler(void);
void UART4_RX_TX_DriverIRQHandler(void)
{
    UART4_DriverIRQHandler();
    SDK_ISR_EXIT_BARRIER;
}
#endif

#if defined(UART5)
void UART5_DriverIRQHandler(void);
void UART5_DriverIRQHandler(void)
{
    s_uartIsr(UART5, s_uartHandle[5]);
    SDK_ISR_EXIT_BARRIER;
}

void UART5_RX_TX_DriverIRQHandler(void);
void UART5_RX_TX_DriverIRQHandler(void)
{
    UART5_DriverIRQHandler();
    SDK_ISR_EXIT_BARRIER;
}
#endif
